---
kind: method
id: M:Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.GetBoundingElements
source: html/7eb2fdb7-643a-eff3-851e-df317d882ad0.htm
---
# Autodesk.Revit.DB.Analysis.BuildingEnvelopeAnalyzer.GetBoundingElements Method

Returns the collection of building elements exposed to the outside forming the building envelope.

## Syntax (C#)
```csharp
public IList<LinkElementId> GetBoundingElements()
```

## Returns
The ids of the building elements in the envelope.